[
  {
    "name": "Alum Rock County Park",
    "description": "A reasonably nice city park, good viewspot at the top (&quot;Eagle Rock&quot;). Mostly dirt road, with some short sections of technical downhill singletrack. Can get a little crowded due to proximity to the city  There's a big &quot;Alum Rock County Park&quot; sign up on the cliff; enter the park to the right of the sign, and go up the trail next to some rough wooden steps. Follow the trail on up until it goes onto the main (paved) road into the park. Go up on the road for about a hundred yards, then a sharp left onto dirt ramp; at the top, turn sharply right onto a dirt road above the paved road. Eventually, it crosses a bridge over the paved road. Continue up to the &quot;Youth Science Institute&quot; (there are restrooms and a drinking fountain here). [Optionally, go on up the canyon to get the full sulphur effect of the &quot;Mineral Springs&quot; that made this park a famous resort many decades ago. Return via the same route, to the &quot;YSI&quot; building.  Across the paved road from the YSI, the &quot;North Rim Trail&quot; starts up the side of the canyon. (It's paved here.) Climb up it, continuing along the north rim of the canyon. Shortly, the pavement disappears and there is a gate to go around; the trail snakes up and down (but mostly up) towards Eagle Rock (you can recognize it by all the antennae on it). One turnoff to the right is labeled &quot;Loop Trail&quot; -- worth avoiding unless you're into steep climbs. A couple of spots along the main trail get pretty steep -- you can avoid the second one by staying left as the road forks just at the bottom of that steep part, then taking the switchback right turn that goes up to the top of that part.  Once you get up to Eagle Rock (elev. 790'), take a break. Take some pictures. To get down, take mostly right turns. At one spot, you're headed West (out towards San Jose) and the trail has a steep branch down to the left, but also continues a lot less steeply, sorta straight. You can see where the steep left branch goes down to another trail. At that point, take that steep left branch -- the other just goes out to a small place where a couple of goats live, and peters out. That steep descent is the trickiest technical challenge on this route.  At the bottom of that steep left branch, turn rightish onto the trail that stays just above the paved road. There's one nasty down-and-up right turn that's easy to miss (but if you do, it just puts you out onto the paved road). Once the trail really puts you back onto the road, go right, down the road about 50 or 100 yards, then turn sharply left onto a small trail that takes you back to the main entrance trail, just above those &quot;rough wooden steps&quot; that were right by the start of the ride.",
    "city": "San Jose, CA",
    "imgFile": ""
  },
  {
    "name": "EL Corte De Madera Creek Open Space",
    "description": "There are maps at the trailhead and there are several trails you can combine to make short or long loops.  You start at about 2000 ft and drop into the forest on  singletrack/doubletrack trails.  The downhill can be long and fun, but remember you have to climb up eventually so save some energy.  You may encounter a few rocky technical sections on the descent.  There is a lot of tight, fast singletrack that curves in and out of the humongous redwoods.  Some of the best singletrack I have ever ridden.  The first time I went we took the Timberview Trail to the Virginia Mill Trail.  Had to dismount and cross a creek at the Virgina Mill Trail because some trees were knocked down covering the trail.  We climbed up on the South/North Leaf trails and finally took the El Corte de Madera Creek Trail back to Skeggs point.  The trails are all well marked, I'll definitely be back to ride some of the other trails in the network.  If you are looking for awesome downhill, sweet singletrack, or a test of your climbing abilities, this place has it all.  A great place to get lost in the redwoods.  ",
    "city": "Woodside, CA"
  },
  {
    "name": "Fremont Older",
    "description": "From the sunken parking lot, ride farther into the park on the paved road. Take the ?Canyon? Trail (dirt road), which goes off to the left from the paved road, and then starts a long (10 to 20 minute) climb up into the park. There isn't much shade on this climb, and it can be unpleasantly hot. At the top of the climb, there are some oak trees and some great views. The road continues along the ridge with some downs-and-ups (mostly up), and a couple of roads descend to the left as you climb to the junction with the Lookout Trail.  Just above the Lookout trail, there is a wide flat spot, and a short singletrack descends from it to the Lookout trail. [Option: take Lookout trail, it returns to this main trail a ways farther down.] Continue on the ridge trail as it descends to the gate into the Garrod Stables property. Cross into that area, and at the &quot;Nob Hill&quot; sign, climb UP the challenging singletrack. (Or, you can go around Nob Hill by veering left here.) From the top of the hill, go on down the other side, where we rejoin the weenie trail around Nob hill.  Go on and then bear left, and this trail hits a tee intersection. (A left would take you down (and up) some fun singletrack, but that's for another day.) Turn right at that tee, and you will descend on singletrack along the fence at the edge of the park. You'll pass through a gate, and come to a very steep downhill section (again, there is a bunny trail around the worst part) with some wooden waterbars with dropoffs on the downhill sides. Get some speed on the last bit of this section so that you can climb the short but challenging hill to the water tower.  After that, the trail goes out to a road (Parker Ranch Court, I believe), then back onto trail along next to the golf course. The trail here has a short section of paved singletrack! After it goes back out to the road again, you have to do a few kilometers of road riding (bear left onto Parker Ranch Court, then left onto a short (unnamed?) road that crosses the creek, and then left onto Prospect Road). At the end of Prospect Road, you are at &quot;the Prospect side&quot;.  Go on up the (paved) hill, turn right onto the trail/road that then continues up into the park. At the top of this trail (a grassy knoll we'll call &quot;Point A&quot;), turn right. This takes you out towards the Bay, to a complex junction (&quot;Point B&quot;) where the road you're on continues steeply up, or you could turn right to go down another steep road, or a single-track (&quot;Seven Springs Loop&quot;) traverses the hill, between the two wider-road choices. If you go up the steep hill, you get to &quot;Hunter's Point&quot;, a great view of the west side of the Santa Clara Valley, and a fun but very steep descent to join up with Seven Springs Loop. It's a pretty fun, mostly downhill singletrack, and a fairly steep climb back up. I've heard the last bit of that climb referred to as &quot;The Wall",
    "city": "Cupertino, CA"
  }
]
